БухЭксп/Documents/CW_КорректировкаОперативнойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_КорректировкаОперативнойЗадолженности</Name>
			<BasedOn>
				<xr:Item>Document.CW_КорректировкаАктированияСчетов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.CW_МСФО</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяКредиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяДебиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаИсходящихСчетов</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаВходящихДокументов</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаИсходящихДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперацийКорректировкиОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентКредитор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.CW_МСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговоруКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписаниеОперативнойЗадолженности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументАкт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДебиторскаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КредиторскаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ОперативнаяКредиторскаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ОперативнаяКредиторскаяЗадолженность</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыДвиженийПоОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_КорректировкаОперативнойЗадолженности/Forms/ФормаСписаниеЗадолженности/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	ОпределитьПараваДоступа();
	
	ВалютаРегламентированногоУчета = CW_Настройки.ВалютаРегламентированногоУчета();
	
	Если Параметры.Ключ.Пустая() Тогда
		ОсновнаяОрганизация = CW_Настройки.ОсновнаяОрганизация();
		Объект.Организация  = ОсновнаяОрганизация;	
	КонецЕсли;
	
	СформироватьЗаголовокДокумента();

	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП

	УстановитьВидимостьВалютныхПоказателей();
	УстановитьДоступныеТипыДокументаОснования();
	УправлениеЭлементамиФормы();
	ОбновитьИтогиНаФорме();
	
	
	#Область МСФО_Модуль
	СчетСписанияПриИзмененииНаСервере();
	#КонецОбласти
	
	//Подсистема.УчетПриложенийДоговоров
	УстановитьВидимостьПриложенийДоговоров();
	//Подсистема.УчетПриложенийДоговоров
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры   

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьДобавленныеКолонкиТабличныхЧастей(ТекущийОбъект, "СписаниеОперативнойЗадолженности");
	
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СформироватьЗаголовокДокумента();  
	
	ЗаполнитьДобавленныеКолонкиТабличныхЧастей(ТекущийОбъект, "СписаниеОперативнойЗадолженности");

	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
			
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	СформироватьЗаголовокДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	СформироватьЗаголовокДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУстановкиНовогоНомера(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УстановитьНовыйНомерНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьНовыйНомерНаСервере()
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	ТОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ТОбъект,"Объект");
	
КонецФункции   

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОчиститьТабличныеЧастиДокумента();
	
	Если (ЗначениеЗаполнено(Объект.Номер) И ЗначениеЗаполнено(Объект.Организация)) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУстановкиНовогоНомера",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Установить новый номер документа", РежимДиалогаВопрос.ДаНет); 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Функция КонтрагентПриИзмененииНаСервере()

	ОчиститьТабличныеЧастиДокумента();
	УправлениеЭлементамиФормы();
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииКонтрагентаНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров

КонецФункции

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	//Подсистема.УчетПриложенийДоговоров
	ДоговорПриИзмененииНаСервере();
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТабличныхЧастей(ТекущийОбъект, ИмяТаблицы)
	
	Для Каждого СтрокаТаблицы из ТекущийОбъект[ИмяТаблицы] Цикл   
		ИндексСтроки  = ТекущийОбъект[ИмяТаблицы].Индекс(СтрокаТаблицы);  

		СтрокаОбъекта = Объект[ИмяТаблицы][ИндексСтроки];
		Если ТипЗнч(СтрокаОбъекта.ДокументСчет)=Тип("ДокументСсылка.CW_КорректировкаОперативнойЗадолженности") Тогда 
			СтрокаОбъекта.Представление =  СокрЛП(СтрокаОбъекта.ДокументСчет);
		ИначеЕсли ТипЗнч(СтрокаОбъекта.ДокументСчет)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") или
                  ТипЗнч(СтрокаОбъекта.ДокументСчет)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") 
		Тогда
			СтрокаОбъекта.Представление = СтрокаОбъекта.ДокументСчет.ПредставлениеДокумента; 
		Иначе
			СтрокаОбъекта.Представление = СтрокаОбъекта.ДокументСчет;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.СтраницаКомментарий.Заголовок = " Комментарий" +?(ЗначениеЗаполнено(Объект.Комментарий)," (*)","");
	Элементы.СтраницаСчетУчетаЗатрат.Видимость = ПолучитьФункциональнуюОпцию("CW_ВедениеБухгалтескогоУчетаМСФО");
	
КонецПроцедуры

Функция ОпределитьПараваДоступа()
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_ОперативныйУчет");
	Если НЕ ПравоРедактирования ИЛИ ЭтаФорма.ТолькоПросмотр Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СформироватьЗаголовокДокумента()
	
	ЗаголовокДокумента = 
		"Корректировка оперативной задолженности" + " " 
		+ ?(ЗначениеЗаполнено(Объект.ВидОперации), "("+нрег(Объект.ВидОперации)+")", "")
		+ ?(ЗначениеЗаполнено(Объект.Ссылка), " "+Объект.Номер+" от "+Объект.Дата, " (создание)");
	ЭтаФорма.Заголовок = ЗаголовокДокумента;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКорректировку(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВопросаОчисткиКорректировки",ЭтотОбъект); 
	
	Если Объект.СписаниеОперативнойЗадолженности.Количество() > 0 Тогда
		ПоказатьВопрос(ОписаниеОповещения, "Табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОчисткиКорректировки(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда  
		Отказ = ложь;
		ПроверитьЗаполнениеРеквизитов(Отказ);
		Если Отказ Тогда
			Возврат;    
		Конецесли; 
		
		ЗаполнитьКорректировкуНаСервере();
		ОбновитьИтогиНаФорме();
	КонецЕсли; 
	
КонецПроцедуры  

&НаСервере 
Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран договор.",,"Договор", "Объект", Отказ);
	Иначе
		Если Не ЗначениеЗаполнено(Объект.Договор.ВидДоговора) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан вид договора.",,"Договор", "Объект", Отказ);
		Иначе
			ДоступныеВидыДоговоров = новый Массив;
			ДоступныеВидыДоговоров.добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
			ДоступныеВидыДоговоров.добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
			Если ДоступныеВидыДоговоров.Найти(Объект.Договор.ВидДоговора)= Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Некорректный вид договора.",,"Договор", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКорректировкуНаСервере() 
	
	Объект.СписаниеОперативнойЗадолженности.Очистить();
	
	Если Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет КАК ДокументСчет,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет.Дата КАК ДокументДата,
		|	ВЫБОР
		|		КОГДА CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет ССЫЛКА Документ.CW_КорректировкаОперативнойЗадолженности
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет)
		|		ИНАЧЕ CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет.ПредставлениеДокумента
		|	КОНЕЦ КАК Представление,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.СчетУчета КАК СчетЗадолженности,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Валюта КАК Валюта,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК СуммаВал,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.ВсегоОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Контрагент = &Контрагент
		|				И Договор = &Договор
		//Подсистема.УчетПриложенийДоговоров
		|				И ПриложениеКДоговору = &ПриложениеКДоговору) КАК CW_ОперативнаяКредиторскаяЗадолженностьОстатки";
		//Подсистема.УчетПриложенийДоговоров
		
	КонецЕсли;
	
	Если Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет КАК ДокументСчет,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет.Дата КАК ДокументДата,
		|	ВЫБОР
		|		КОГДА CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет ССЫЛКА Документ.CW_КорректировкаОперативнойЗадолженности
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет)
		|		ИНАЧЕ CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет.ПредставлениеДокумента
		|	КОНЕЦ КАК Представление,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.СчетУчета КАК СчетЗадолженности,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Валюта КАК Валюта,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК СуммаВал,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.ВсегоОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Контрагент = &Контрагент
		|				И Договор = &Договор
		//Подсистема.УчетПриложенийДоговоров
		|				И ПриложениеКДоговору = &ПриложениеКДоговору) КАК CW_ОперативнаяДебиторскаяЗадолженностьОстатки";
		//Подсистема.УчетПриложенийДоговоров
		
	КонецЕсли;   
	
	Запрос.УстановитьПараметр("Период", 		Новый Граница(Объект.Дата,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", 	Объект.Контрагент);
	Запрос.УстановитьПараметр("Договор", 		Объект.Договор);
		
  	//Подсистема.УчетПриложенийДоговоров
	Запрос.УстановитьПараметр("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока =  Объект.СписаниеОперативнойЗадолженности.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		КурсПоСтроке = 1; КратностьПоСтроке = 1;
		Если Выборка.Валюта <> ВалютаРегламентированногоУчета Тогда
			КурсПоСтроке = ?(Выборка.СуммаВал = 0, 1, Окр(Выборка.Сумма / Выборка.СуммаВал, 4));
			
			ДатаКурса = Объект.Дата;
			Если ЗначениеЗаполнено(Выборка.ДокументСчет) тогда
				ДатаКурса = Выборка.ДокументДата;
			КонецЕсли;
			
			ДанныеКурса 		= CW_Финансы.ПолучитьКурсВалюты(Выборка.Валюта, ДатаКурса);  
			КратностьПоСтроке 	= ДанныеКурса.Кратность;
			КурсПоСтроке 		= Окр(КурсПоСтроке * КратностьПоСтроке, 4);
		КонецЕсли;
		
		НоваяСтрока.Курс 		= КурсПоСтроке;
		НоваяСтрока.Кратность 	= КратностьПоСтроке;
	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ОчиститьТабличныеЧастиДокумента()
	
	Объект.СписаниеОперативнойЗадолженности.Очистить();
	ОбновитьИтогиНаФорме();
	
КонецФункции
 
&НаКлиенте
Процедура ОчиститьКорректировку(Команда)
	
	Объект.СписаниеОперативнойЗадолженности.Очистить();
	ОбновитьИтогиНаФорме();
	
КонецПроцедуры


&НаКлиенте
Процедура КорректировкаПриИзменении(Элемент)
	
	ОбновитьИтогиНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаДокументСчетПриИзменении(Элемент)
	ОбработатьИзменениеСчета();
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьИзменениеСчета() 
	
	ТекущаяСтрока = Элементы.Корректировка.ТекущаяСтрока;
	ОбработатьИзменениеСчетаНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСчетаНаСервере(Знач ИдентификаторСтроки)
	
	СтрокаТаблицы = Объект.СписаниеОперативнойЗадолженности.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если Объект.Договор.ВалютаДоговора = ВалютаРегламентированногоУчета Тогда
		СтрокаТаблицы.Валюта	= ВалютаРегламентированногоУчета;
		СтрокаТаблицы.Курс 		= 1;
		СтрокаТаблицы.Кратность = 1;                         
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаСуммаВалПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Корректировка.ТекущаяСтрока; 
	ПересчитатьСуммуПоКурсуНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Корректировка.ТекущаяСтрока; 
	ПересчитатьСуммуВалПоКурсуНаСервере(ТекущаяСтрока);
	
КонецПроцедуры   

&НаКлиенте
Процедура КорректировкаКурсПриИзменении(Элемент)   
	
	ТекущаяСтрока = Элементы.Корректировка.ТекущаяСтрока; 
	ПересчитатьСуммуПоКурсуНаСервере(ТекущаяСтрока);
	
КонецПроцедуры


&НаКлиенте
Процедура КорректировкаКратностьПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Корректировка.ТекущаяСтрока; 
	ПересчитатьСуммуПоКурсуНаСервере(ТекущаяСтрока);

КонецПроцедуры


&НаСервере
Процедура ОбновитьИтогиНаФорме()
	
	//Списание задолженности
	ИтогоПоКорректировке =	"Всего: "+Формат(Объект.СписаниеОперативнойЗадолженности.Итог("СуммаВал"),"ЧЦ=15; ЧДЦ=2; ЧН=") +" " +Строка(Объект.Договор.ВалютаДоговора);
	//--Списание задолженности
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВалютныхПоказателей()
	
	Элементы.КорректировкаГруппаВалюта.Видимость = (Не Объект.Договор.ВалютаДоговора.Пустая() И 
													Объект.Договор.ВалютаДоговора <> ВалютаРегламентированногоУчета);

КонецПроцедуры     

&НаСервере
Процедура УстановитьДоступныеТипыДокументаОснования()
	
	ОграничениеТипа = ПолучитьДоступныеТипыДокументаОснования();
	Элементы.КорректировкаДокументСчет.ОграничениеТипа  = Новый ОписаниеТипов(ОграничениеТипа);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступныеТипыДокументаОснования()
	
	мТипы = Новый Массив;   

	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		Возврат мТипы;
	КонецЕсли;
	
	мТипы.Добавить(Тип("ДокументСсылка.CW_КорректировкаОперативнойЗадолженности"));
	мТипы.Добавить(Тип("ДокументСсылка.CW_ДвижениеДенежныхСредств"));
	мТипы.Добавить(Тип("ДокументСсылка.CW_Оплата"));
	
	Если Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда 
		мТипы.Добавить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"));                           
	Иначе
		мТипы.Добавить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке"));                          
	КонецЕсли;
	
	Возврат мТипы; 
	
КонецФункции

&НаКлиенте
Процедура КорректировкаВалютаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Корректировка.ТекущаяСтрока;
	ОбработатьИзменениеВалюты(ТекущаяСтрока);

КонецПроцедуры 


&НаКлиенте
Процедура КорректировкаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		ТекущаяСтрока = Элементы.Корректировка.ТекущаяСтрока;
		КорректировкаПриНачалеРедактированияНаСервере(ТекущаяСтрока);
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура КорректировкаПриНачалеРедактированияНаСервере(ТекущаяСтрока)
	
	СтрокаТекущая = Объект.СписаниеОперативнойЗадолженности.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаТекущая.Валюта = Объект.Договор.ВалютаДоговора;

	ОбработатьИзменениеВалюты(ТекущаяСтрока);
	
КонецПроцедуры



&НаСервере
Процедура ОбработатьИзменениеВалюты(ТекущаяСтрока)

	СтрокаТекущая = Объект.СписаниеОперативнойЗадолженности.НайтиПоИдентификатору(ТекущаяСтрока);  
	
	ДатаКурса  = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	КурсВалюты = CW_Финансы.ПолучитьКурсВалюты(СтрокаТекущая.Валюта, ДатаКурса);
	
	СтрокаТекущая.Курс 		= КурсВалюты.Курс;
	СтрокаТекущая.Кратность = КурсВалюты.Кратность;

	ПересчитатьСуммуПоКурсуНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуПоКурсуНаСервере(ТекущаяСтрока)

	СтрокаТекущая = Объект.СписаниеОперативнойЗадолженности.НайтиПоИдентификатору(ТекущаяСтрока);   
	
	СтрокаТекущая.Сумма =  CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаТекущая.СуммаВал,
									СтрокаТекущая.Валюта,ВалютаРегламентированногоУчета, 
									СтрокаТекущая.Курс, 1,  
									СтрокаТекущая.Кратность, 1);

КонецПроцедуры   

&НаСервере
Процедура ПересчитатьСуммуВалПоКурсуНаСервере(ТекущаяСтрока)  
	
	СтрокаТекущая = Объект.СписаниеОперативнойЗадолженности.НайтиПоИдентификатору(ТекущаяСтрока);   

	СтрокаТекущая.СуммаВал =  CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаТекущая.Сумма,
									ВалютаРегламентированногоУчета,СтрокаТекущая.Валюта, 
									1, СтрокаТекущая.Курс, 
									1, СтрокаТекущая.Кратность);

КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область МСФО_Модуль

&НаКлиенте
Процедура СчетСписанияПриИзменении(Элемент)
	СчетСписанияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СчетСписанияПриИзмененииНаСервере()
	
	CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьСвойстваСубконтоШапкиПриИзмененииСчета(
	ЭтотОбъект, ЭтотОбъект.Объект, ПараметрыУстановкиСвойствСубконто(ЭтотОбъект));
	
КонецПроцедуры

&НаСервере
Функция ПараметрыУстановкиСвойствСубконто(Форма, Постфикс = "") Экспорт
	
	Результат = CW_БухгалтерскийУчетКлиентСерверМСФО.ПараметрыУстановкиСвойствСубконтоПоШаблону(
		"Субконто"      + Постфикс,
		"Подразделение" + Постфикс,
		"Субконто",
		"Подразделение",
		"СчетСписания");
	
	Результат.ДопРеквизиты.Вставить("Организация", Форма.Объект.Организация);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Субконто1ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто2ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 2);
	
КонецПроцедуры


&НаКлиенте
Процедура Субконто3ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСубконто(Форма, НомерСубконто)
	
	тОбъект = Форма.Объект;
	
	CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьСвойстваСубконтоШапкиПриИзмененииСубконто(
		Форма, тОбъект, НомерСубконто, ПолучитьПараметрыУстановкиСвойствСубконтоНаСервере());
	
КонецПроцедуры


&НаКлиенте
Процедура Субконто1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры


&НаКлиенте
Процедура Субконто3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры


&НаКлиенте
Процедура СубконтоНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка)

	тОбъект = Форма.Объект;
	
	ДанныеОбъекта = CW_БухгалтерскийУчетКлиентСерверМСФО.ДанныеУстановкиПараметровСубконто(
		тОбъект, ПолучитьПараметрыУстановкиСвойствСубконтоНаСервере());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыУстановкиСвойствСубконтоНаСервере()
	Возврат  ПараметрыУстановкиСвойствСубконто(ЭтотОбъект, "");
КонецФункции

#КонецОбласти

//Подсистема.УчетПриложенийДоговоров
&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	Если Не Объект.Договор.ИспользуютсяПриложения Тогда
		Объект.ПриложениеКДоговору = Неопределено;
	КонецЕсли;
	
	ОчиститьТабличныеЧастиДокумента();
	
	УстановитьВидимостьВалютныхПоказателей();
	УстановитьВидимостьПриложенийДоговоров();
	УстановитьДоступныеТипыДокументаОснования();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПриложенийДоговоров()
	
	Элементы.ПриложениеКДоговору.Видимость = Объект.Договор.ИспользуютсяПриложения;
	
КонецПроцедуры
//Подсистема.УчетПриложенийДоговоров
